# Задача А:

times = int(input('Сколько раз повторить? '))
for i in range(0, times):
    print('Сообщение')


# Задача B:

number = input('Введите число: ')
count = number.count('1')
print(f'Единиц: {count}')
